<a href="https://colab.research.google.com/github/Hira63S/data-science/blob/master/Hira_Final_csv.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
url = 'https://raw.githubusercontent.com/Hira63S/Master-Your-Money/master/2017%20Quarter%204%20-Big%20Categories%20expenditure.csv'

In [0]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_absolute_error, mean_squared_error, r2_score
from sklearn.model_selection import train_test_split

In [9]:
data = pd.read_csv(url)

data.head()

     NEWID  Age  Education  ...    Food  Transport  Entertainment
0  3566504   26         14  ...  1690.0     3771.0           42.0
1  3566514   62         14  ...  1365.0      772.0          465.0
2  3566534   54         15  ...  3931.0     5536.0         4191.0
3  3566544   39         12  ...  3640.0     3351.0         1151.0
4  3566624   43         15  ...  1885.0     2805.0            0.0

[5 rows x 9 columns]

In [10]:
bins = [0,15000,20000,25000,30000,40000,50000,60000,80000,100000,150000,250000,500000,1000000]
labels=[0,1,2,3,4,5,6,7,8,9,10,11,12]
data['Inc_cat'] = pd.cut(data['Income_AT'], bins=bins, labels=labels, include_lowest=True)
data.head()

     NEWID  Age  Education  Income_AT  ...    Food  Transport  Entertainment  Inc_cat
0  3566504   26         14    90691.9  ...  1690.0     3771.0           42.0        8
1  3566514   62         14    63421.0  ...  1365.0      772.0          465.0        7
2  3566534   54         15  -191620.6  ...  3931.0     5536.0         4191.0      NaN
3  3566544   39         12   136908.0  ...  3640.0     3351.0         1151.0        9
4  3566624   43         15    54347.4  ...  1885.0     2805.0            0.0        6

[5 rows x 10 columns]

In [19]:
data['Luxury'] = (data['Expenses'] - (data['Housing'] + data['Food'] + data['Transport']))

data['Luxury'].head()

0     2669.75
1     1927.00
2    43741.00
3     6904.75
4     1094.80
Name: Luxury, dtype: float64

In [20]:
data.head()

     NEWID  Age  Education  ...  Entertainment  Inc_cat    Luxury
0  3566504   26         14  ...           42.0        8   2669.75
1  3566514   62         14  ...          465.0        7   1927.00
2  3566534   54         15  ...         4191.0      NaN  43741.00
3  3566544   39         12  ...         1151.0        9   6904.75
4  3566624   43         15  ...            0.0        6   1094.80

[5 rows x 11 columns]

In [21]:
data['Inc_cat'].value_counts()

7     769
0     763
4     684
9     648
5     600
8     565
6     465
10    421
1     354
2     350
3     300
11     73
12      0
Name: Inc_cat, dtype: int64

In [0]:
data['Inc_cat'] = data['Inc_cat'].dropna()

In [25]:
data['Inc_cat'].isnull().sum()

12

In [0]:
#df['Necessities'] = (df['Total Housing'] + df['Total Food'] + df['Total Transportation cost'])

#df['Necessities'].head()

0     9200.00
1     5826.00
2    33691.75
3     9584.00
4     7423.50
Name: Necessities, dtype: float64

In [30]:
data_new = pd.DataFrame({'Income_AT':(data['Income_AT']/12)})

data_new.head()

      Income_AT
0   7557.658333
1   5285.083333
2 -15968.383333
3  11409.000000
4   4528.950000

In [0]:
data_new['Expenses'] = data['Expenses']/3
data_new['Housing'] = data['Housing']/3
data_new['Food'] = data['Food']/3
data_new['Transport'] = data['Transport']/3
data_new['Entertainment'] = data['Entertainment']/3
data_new['Luxury'] = data['Luxury']/3

In [0]:
data_new['Age'] = data['Age']
data_new['Education'] = data['Education']
data_new['Inc_cat'] = data['Inc_cat']

In [35]:
data_new.head()

      Income_AT      Expenses      Housing  ...  Age  Education  Inc_cat
0   7557.658333   3956.583333  1246.333333  ...   26         14        8
1   5285.083333   2584.333333  1229.666667  ...   62         14        7
2 -15968.383333  25810.916667  8074.916667  ...   54         15      NaN
3  11409.000000   5496.250000   864.333333  ...   39         12        9
4   4528.950000   2839.433333   911.166667  ...   43         15        6

[5 rows x 10 columns]

In [0]:
data_new = data_new.replace({'?':np.NaN, ' ':np.NaN, '0':np.NaN})

In [69]:
data_new = data_new.dropna()

data_new.isnull().sum()

Income_AT        0
Expenses         0
Housing          0
Food             0
Transport        0
Entertainment    0
Luxury           0
Age              0
Education        0
Inc_cat          0
dtype: int64

In [0]:
features = ['Inc_cat', 'Housing', 'Food', 'Transport', 'Entertainment']
target = 'Luxury'


X = data_new[features]
y = data_new[target]

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.30, random_state = 42)

In [71]:
X_train.shape, X_test.shape, y_train.shape, y_test.shape

((4194, 5), (1798, 5), (4194,), (1798,))

In [72]:
X_train.describe()

            Housing         Food     Transport  Entertainment
count   4194.000000  4194.000000   4194.000000    4194.000000
mean    1162.222555   459.439040    499.604091     145.563000
std     1341.261668   393.483677   1095.587542     369.022650
min        0.000000     0.000000      0.000000       0.000000
25%      410.583417   189.277783     91.666667      16.666667
50%      792.444500   346.666667    266.000000      60.000000
75%     1438.666667   606.666667    574.833333     143.250000
max    30054.333333  4354.888900  30079.000000    9450.000000

In [62]:
data_new.isnull().sum()

Income_AT        0
Expenses         0
Housing          0
Food             0
Transport        0
Entertainment    0
Luxury           0
Age              0
Education        0
Inc_cat          0
dtype: int64

In [0]:
data_new = data_new.dropna()

In [64]:
data_new.isnull().sum()

Income_AT        0
Expenses         0
Housing          0
Food             0
Transport        0
Entertainment    0
Luxury           0
Age              0
Education        0
Inc_cat          0
dtype: int64

In [59]:
data_new['Entertainment'].isnull().sum()

0

In [73]:
model = LinearRegression()
model.fit(X_train, y_train)
y_pred = np.exp(model.predict(X_test)) # Apply exponential function (inverse of natural log) to the predictions
#print('R^2', model.score(X_test, y_pred))

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: RuntimeWarning: overflow encountered in exp
  This is separate from the ipykernel package so we can avoid doing imports until

In [74]:
def run_linear_model(X, y):
    # Split into test and train data
    X_train, X_test, y_train, y_test = train_test_split(X, y, train_size=0.80, test_size=0.20, random_state=42)

    # Fit model using train data
    model = LinearRegression()
    model.fit(X_train, y_train)

    # Make predictions using test features
    y_pred = model.predict(X_test)

    # Compare predictions to test target
    rmse = (np.sqrt(mean_squared_error(y_test, y_pred)))
    r2 = r2_score(y_test, y_pred)

    print('Root Mean Squared Error', rmse)
    print('R^2 Score', r2)
    print('Intercept', model.intercept_)
    coefficients = pd.Series(model.coef_, X_train.columns)
    print(coefficients.to_string())
    
run_linear_model(X, y)

Root Mean Squared Error 1081.7988837184446
R^2 Score 0.43613528723864026
Intercept -384.23427892316545
Inc_cat          101.340585
Housing            0.213407
Food               0.977665
Transport          0.115991
Entertainment      1.484437

In [0]:
#df = df.loc[(df!=0).all(1)]

##Model##

In [0]:
features = ['FINATXEM']

target = '50%'

X = df[features]
y = df[target]


X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.30, random_state = 42)

In [0]:
model = LinearRegression()
model.fit(X_train, y_train)
y_pred = np.exp(model.predict(X_test)) # Apply exponential function (inverse of natural log) to the predictions
print('R^2', model.score(X_test, y_pred))

R^2 -0.0007594206012886406